import { nanoid } from "nanoid";
import getRandomInt from "../../utils/getRandomInt";

const setsNames = [
    "Сет Первый поцелуй",
    "Сет Теплый вечер",
    "Сет Идеальная пара",
    "Сет Мистер Крабс",
    "Сет Калифорния",
    "Бодипозитив",
    "Сет Пошла жара",
    "Сет Жареный",
    "Сет Один дома 2",
    "Сет Филадельфия"
];
const setsCompositions = [
    "Филадельфия микс, Калифорния классик, Краб Чиз.",
    "Фила лайт запеченная, Калифорния жареная, Жареный с тунцом, Митто.",
    "Филадельфия микс, Калифорния микс, Лава с лососем (1/2 порции ).",
    "Калифорния классик, Окинава, ролл с крабом запеченный, Лава с крабом.",
    "Калифорния с лососем, Калифорния запечённая, Калифорния жареная.",
    "Ариго, Жареная Калифорния, Жареный с тунцом, Флорида.",
    "Калифорния с крабом, Лобеко, Митто спайс, ролл с креветкой запеченный.",
    "Ариго, Киото, Окинава, Спайс темпура.",
    "Филадельфия блонд, Калифорния с крабом, ролл с креветкой.",
    "Филадельфия, Филадельфия запеченная, Филадельфия темпура."
];

const sets = setsNames.map((el, i) => ({
    id: nanoid(),
    name: el,
    price: getRandomInt(400, 600),
    composition: setsCompositions[i],
    weight: "450гр 150ккал / 100гр"
}));

const fetchAll = () =>
    new Promise((resolve, reject) => {
        window.setTimeout(function () {
            resolve(sets);
            // resolve(
            //     new Error("sets")
            // );
        }, 2000);
    });

export default {
    fetchAll
};
