import { nanoid } from "nanoid";
import getRandomInt from "../../utils/getRandomInt";

const rollsNames = [
    "Чикен-спайси",
    "Курица терияки",
    "Никайдо",
    "Ролл Аморе",
    "Филадельфия фри",
    "Пикантный бекон",
    "Ханито",
    "Аляска",
    "Хамачи",
    "Саради"
];
const rollsCompositions = [
    "Рис, нори, замес крабовый, лосось, огурец, замес спайс, икра масаго.",
    "Рис, нори, лосось, сыр сливочный, огурец, икра масаго, замес с икрой масаго, кунжут, соус терияки.",
    "Огурцы, ветчина, сыр моцарелла, соус чесночный",
    "Рис, нори, лосось, сыр сливочный, соус терияки, кунжут.",
    "Мясной соус болоньезе, соус бургер, соленые огурчики, лук, мацарелла",
    "Рис, нори, сыр сливочный, окунь в кляре, лосось терияки, замес с икрой масаго.",
    "Рис, нори, сыр сливочный, огурец, тигровая креветка, замес спайси.",
    "Рис, нори, угорь, сыр сливочный, огурец, икра масаго, замес c икрой масаго, соус спайс.",
    "Рис, нори, лосось, сыр сливочный, огурец, кунжут, замес с икрой масаго, соус терияки.",
    "Рис, нори, лосось, тигровая креветка, огурец, сыр сливочный, майонез, соус терияки, лук зеленый."
];

const rolls = rollsNames.map((el, i) => ({
    id: nanoid(),
    name: el,
    price: getRandomInt(400, 600),
    composition: rollsCompositions[i],
    weight: "450гр 150ккал / 100гр"
}));

const fetchAll = () =>
    new Promise((resolve) => {
        window.setTimeout(function () {
            resolve({
                category: "rolls",
                products: rolls
            });
        }, 2000);
    });
const getPart = () =>
    new Promise((resolve) => {
        window.setTimeout(function () {
            resolve(rolls.slice(0, 5));
        }, 1000);
    });

export default {
    fetchAll,
    getPart
};
